In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
names = {1: 'Nourah', 2: 'Sarah', 3: 'Lama'}
s3 = pd.Series(names)
s3

1    Nourah
2     Sarah
3      Lama
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
s3.index = [11, 12, 13]
s3

11    Nourah
12     Sarah
13      Lama
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
s3[0:2]

11    Nourah
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [7]:
s4 = pd.Series({14: 'Nourah', 15: 'Nada'})
s3 = s3.append(s4)
s3

C:\Users\Sheikha\AppData\Local\Temp\ipykernel_10432\627532509.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s3.append(s4)

11    Nourah
12     Sarah
13      Lama
14    Nourah
15      Nada
dtype: object

In [8]:
s3.drop_duplicates()

11    Nourah
12     Sarah
13      Lama
15      Nada
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [9]:
 data = {'ID': [111, 112, 113, 114, 115, 116, 117, 118, 119],
        'Name': ['sheikha', 'arwa', 'nourah', 'sarah', 'lama', 'nada', 'farah',
                 'manar', 'hajar'],
        'GPA':   [5, 4.88, 4.20, 4.69, 4.54, 3.94, 4.13, 5, 4.97]}

students = pd.DataFrame(data, columns=['ID', 'Name', 'GPA'])
students

    ID     Name   GPA
0  111  sheikha  5.00
1  112     arwa  4.88
2  113   nourah  4.20
3  114    sarah  4.69
4  115     lama  4.54
5  116     nada  3.94
6  117    farah  4.13
7  118    manar  5.00
8  119    hajar  4.97

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [11]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [12]:
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [16]:
edu[:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [17]:
edu.loc[:3, ['TIME', 'GEO']]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)

In [18]:
edu.loc[:3,:]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e